FaaS-FT-Checkpointing-Project/tsung_workload.xml
<tsung loglevel="info" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="100" />
  </clients>
  <servers>
    <server host="localhost" port="8888" type="tcp" />
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users maxnumber="60000" interarrival="10" unit="second"></users>
    </arrivalphase>
  </load>
  <options>
    <option name="thinktime" value="0" />
    <option name="duration" value="600" unit="second" />
  </options>
  <sessions>
    <session name="fission_test" probability="100" type="ts_http">
      <request>
        <http url="/" method="POST" contents=\'{"foo":"bar"}\' content_type="application/json" />
      </request>
    </session>
  </sessions>
</tsung>